
#**Pandas**
Pandas stand for Python Data Analysis Library.
Pandas is an open-source Python package that provides high-performance, easy-to-use data structures and data analysis tools for the labeled data in Python programming language. 

# **When to Use?**
Pandas is a perfect tool for data wrangling or munging. It is designed for quick and easy data manipulation, reading, aggregation, and visualization.
Pandas take data in a CSV or TSV file or a SQL database and create a Python object with rows and columns called a data frame. The data frame is very similar to a table in statistical software, say Excel or SPSS.

# **What can you do with Pandas?**
Indexing, manipulating, renaming, sorting, merging data frame
Update, Add, Delete columns from a data frame
Impute missing files, handle missing data or NANs
Plot data with histogram or box plot
This makes Pandas a foundation library in learning Python for Data Science.

In this Video, You will Learn about:
1. Loading and Reading datasets into panda dataframe
2. Basics operations in Pandas
3. Pandas dataframe Counting, Summarized view, Data Types
4. Accessing rows and columns (indexing and selecting data) 
5. Aggregate (groupby) Statistics
6. Exploratory Data Analysis
7. Conditional Probability and Correlation in Pandas
8. Filling Missing values in Pandas Dataframes
9. Reading and Writing Data to Different Sources 



# Demo Assignment with Solutions

After watching this video, you can check:
1. assumptions about your data
2. whether your results are reasonable
3. out for small sample sizes
4. the impact of missing data

In [ ]:
pip install pandas
pip install numpy

In [ ]:
#importing Libraries
import pandas as pd
import numpy as np

#**Loading and Reading datasets into pandas dataframe**

In [ ]:
#load data from CSV file to a pandas dataframe
data= pd.read_csv('Covid_19.csv')

In [ ]:
data = pd.read_csv('Covid_19.csv', index_col=0)     #Can also set index col acc to you

In [ ]:
data.head()

,Name of State / UT,Total Confirmed cases (Indian National),Total Confirmed cases ( Foreign National ),Cured/Discharged/Migrated,Latitude,Longitude,Death,Total Confirmed cases
Date,,,,,,,,
2020-01-30,Kerala,1,0,0,10.8505,76.2711,0,1
2020-01-31,Kerala,1,0,0,10.8505,76.2711,0,1
2020-02-01,Kerala,2,0,0,10.8505,76.2711,0,2
2020-02-02,Kerala,3,0,0,10.8505,76.2711,0,3
2020-02-03,Kerala,3,0,0,10.8505,76.2711,0,3

### **1 Q) Set 'Name of State / UT' Columns as an index of the dataset**

In [ ]:
data.set_index('Name of State / UT',inplace=True)        #to make changes permanent, use "inplace=True"
data.head()

,Total Confirmed cases (Indian National),Total Confirmed cases ( Foreign National ),Cured/Discharged/Migrated,Latitude,Longitude,Death,Total Confirmed cases
Name of State / UT,,,,,,,
Kerala,1,0,0,10.8505,76.2711,0,1
Kerala,1,0,0,10.8505,76.2711,0,1
Kerala,2,0,0,10.8505,76.2711,0,2
Kerala,3,0,0,10.8505,76.2711,0,3
Kerala,3,0,0,10.8505,76.2711,0,3

In [ ]:
data.reset_index()

,Name of State / UT,Total Confirmed cases (Indian National),Total Confirmed cases ( Foreign National ),Cured/Discharged/Migrated,Latitude,Longitude,Death,Total Confirmed cases
0,Kerala,1,0,0,10.8505,76.2711,0,1
1,Kerala,1,0,0,10.8505,76.2711,0,1
2,Kerala,2,0,0,10.8505,76.2711,0,2
3,Kerala,3,0,0,10.8505,76.2711,0,3
4,Kerala,3,0,0,10.8505,76.2711,0,3
...,...,...,...,...,...,...,...,...
914,Telengana,0,0,43,18.1124,79.0193,9,504
915,Tripura,0,0,0,23.9408,91.9882,0,2
916,Uttar Pradesh,0,0,46,26.8467,80.9462,5,483
917,Uttarakhand,0,0,5,30.0668,79.0193,0,35
918,West Bengal,0,0,29,22.9868,87.8550,7,152

In [ ]:
data= pd.read_csv('Covid_19.csv')

**Reading Data in pandas**

In [ ]:
#to get first 5 rows...if you want n values...place head(n)...n can be 6 or any no.
data.head()

,Date,Name of State / UT,Total Confirmed cases (Indian National),Total Confirmed cases ( Foreign National ),Cured/Discharged/Migrated,Latitude,Longitude,Death,Total Confirmed cases
0,2020-01-30,Kerala,1,0,0,10.8505,76.2711,0,1
1,2020-01-31,Kerala,1,0,0,10.8505,76.2711,0,1
2,2020-02-01,Kerala,2,0,0,10.8505,76.2711,0,2
3,2020-02-02,Kerala,3,0,0,10.8505,76.2711,0,3
4,2020-02-03,Kerala,3,0,0,10.8505,76.2711,0,3

Note

 DataFrame is a 2-dimensional labeled data structure with columns of potentially different types.

In [ ]:
#to get last 5 rows
data.tail()

,Date,Name of State / UT,Total Confirmed cases (Indian National),Total Confirmed cases ( Foreign National ),Cured/Discharged/Migrated,Latitude,Longitude,Death,Total Confirmed cases
914,2020-04-13,Telengana,0,0,43,18.1124,79.0193,9,504
915,2020-04-13,Tripura,0,0,0,23.9408,91.9882,0,2
916,2020-04-13,Uttar Pradesh,0,0,46,26.8467,80.9462,5,483
917,2020-04-13,Uttarakhand,0,0,5,30.0668,79.0193,0,35
918,2020-04-13,West Bengal,0,0,29,22.9868,87.8550,7,152

#**Basics operations in Pandas**

In [ ]:
#to get total no of elements
data.size

8271

In [ ]:
#to get dimensions of dataframe (df) rows and columns
data.shape

(919, 9)

### **2 Q) How many number of rows and columns are present in your dataset?**

In [ ]:
print("The number of rows are: ", data.shape[0])
print("The number of columns are: ", data.shape[1])

The number of rows are:  919
The number of columns are:  9

In [ ]:
#to get memory usage of each column
data.memory_usage()

Index                                          128
Date                                          7352
Name of State / UT                            7352
Total Confirmed cases (Indian National)       7352
Total Confirmed cases ( Foreign National )    7352
Cured/Discharged/Migrated                     7352
Latitude                                      7352
Longitude                                     7352
Death                                         7352
Total Confirmed cases                         7352
dtype: int64

In [ ]:
#Concise Summary of Dataframe
data.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 919 entries, 0 to 918
Data columns (total 9 columns):
 #   Column                                      Non-Null Count  Dtype
---  ------                                      --------------  -----
 0   Date                                        919 non-null    object
 1   Name of State / UT                          919 non-null    object
 2   Total Confirmed cases (Indian National)     919 non-null    int64
 3   Total Confirmed cases ( Foreign National )  919 non-null    int64
 4   Cured/Discharged/Migrated                   919 non-null    int64
 5   Latitude                                    919 non-null    float64
 6   Longitude                                   919 non-null    float64
 7   Death                                       919 non-null    int64
 8   Total Confirmed cases                       919 non-null    int64
dtypes: float64(2), int64(5), object(2)
memory usage: 64.7+ KB

In [ ]:
pd.set_option('display.max_columns',12)        #How many columns want to display

In [ ]:
data

,Date,Name of State / UT,Total Confirmed cases (Indian National),Total Confirmed cases ( Foreign National ),Cured/Discharged/Migrated,Latitude,Longitude,Death,Total Confirmed cases
0,2020-01-30,Kerala,1,0,0,10.8505,76.2711,0,1
1,2020-01-31,Kerala,1,0,0,10.8505,76.2711,0,1
2,2020-02-01,Kerala,2,0,0,10.8505,76.2711,0,2
3,2020-02-02,Kerala,3,0,0,10.8505,76.2711,0,3
4,2020-02-03,Kerala,3,0,0,10.8505,76.2711,0,3
...,...,...,...,...,...,...,...,...,...
914,2020-04-13,Telengana,0,0,43,18.1124,79.0193,9,504
915,2020-04-13,Tripura,0,0,0,23.9408,91.9882,0,2
916,2020-04-13,Uttar Pradesh,0,0,46,26.8467,80.9462,5,483
917,2020-04-13,Uttarakhand,0,0,5,30.0668,79.0193,0,35
918,2020-04-13,West Bengal,0,0,29,22.9868,87.8550,7,152

### **3 Q) How many unique values are there in Name of State / UT column?**

In [ ]:
#Get the unique category counts
data['Name of State / UT'].value_counts()

Kerala                                  75
Delhi                                   43
Telengana                               43
Rajasthan                               42
Haryana                                 41
Uttar Pradesh                           41
Tamil Nadu                              38
Maharashtra                             36
Karnataka                               36
Punjab                                  36
Andhra Pradesh                          33
Uttarakhand                             30
Odisha                                  29
Puducherry                              27
Chhattisgarh                            26
Gujarat                                 25
Chandigarh                              24
Jammu and Kashmir                       24
West Bengal                             24
Madhya Pradesh                          24
Himachal Pradesh                        24
Ladakh                                  24
Bihar                                   23
Manipur                                 21
Mizoram                                 20
Goa                                     19
Andaman and Nicobar Islands             19
Union Territory of Ladakh               14
Jharkhand                               13
Assam                                   13
Union Territory of Jammu and Kashmir    12
Arunachal Pradesh                       11
Tripura                                  7
Union Territory of Chandigarh            2
Name: Name of State / UT, dtype: int64

In [ ]:
#to display column labels
data.columns

Index(['Date', 'Name of State / UT', 'Total Confirmed cases (Indian National)',
       'Total Confirmed cases ( Foreign National )',
       'Cured/Discharged/Migrated', 'Latitude', 'Longitude', 'Death',
       'Total Confirmed cases'],
      dtype='object')

In [ ]:
#to display row labels
data.index

RangeIndex(start=0, stop=919, step=1)

#**Data Types**
**Checking data types of each column**

In [ ]:
data.dtypes

Date                                           object
Name of State / UT                             object
Total Confirmed cases (Indian National)         int64
Total Confirmed cases ( Foreign National )      int64
Cured/Discharged/Migrated                       int64
Latitude                                      float64
Longitude                                     float64
Death                                           int64
Total Confirmed cases                           int64
dtype: object

**Seleting data based on data types**

### **4 Q) Select only integer and float datatypes from the dataset.**

In [ ]:
data.select_dtypes(include=[], exclude=[object])

,Total Confirmed cases (Indian National),Total Confirmed cases ( Foreign National ),Cured/Discharged/Migrated,Latitude,Longitude,Death,Total Confirmed cases
0,1,0,0,10.8505,76.2711,0,1
1,1,0,0,10.8505,76.2711,0,1
2,2,0,0,10.8505,76.2711,0,2
3,3,0,0,10.8505,76.2711,0,3
4,3,0,0,10.8505,76.2711,0,3
...,...,...,...,...,...,...,...
914,0,0,43,18.1124,79.0193,9,504
915,0,0,0,23.9408,91.9882,0,2
916,0,0,46,26.8467,80.9462,5,483
917,0,0,5,30.0668,79.0193,0,35
918,0,0,29,22.9868,87.8550,7,152

### **5 Q) Select only object datatype from the dataset.**

In [ ]:
data.dtypes == "object"

Date                                           True
Name of State / UT                             True
Total Confirmed cases (Indian National)       False
Total Confirmed cases ( Foreign National )    False
Cured/Discharged/Migrated                     False
Latitude                                      False
Longitude                                     False
Death                                         False
Total Confirmed cases                         False
dtype: bool

In [ ]:
a = data.dtypes[data.dtypes == "object"].index
a

Index(['Date', 'Name of State / UT'], dtype='object')

**Converting variableâ€™s data types**

In [ ]:
data.dtypes

Date                                           object
Name of State / UT                             object
Total Confirmed cases (Indian National)         int64
Total Confirmed cases ( Foreign National )      int64
Cured/Discharged/Migrated                       int64
Latitude                                      float64
Longitude                                     float64
Death                                           int64
Total Confirmed cases                           int64
dtype: object

In [ ]:
data['Death'] = data['Death'].astype('object')

In [ ]:
data['Death'].dtypes

dtype('O')

#**Accessing rows and columns (indexing and selecting data)**
* Label-based 'loc' method
* Index (numeric) 'iloc' method

In [ ]:
data['Total Confirmed cases']        #single column

0        1
1        1
2        2
3        3
4        3
      ...
914    504
915      2
916    483
917     35
918    152
Name: Total Confirmed cases, Length: 919, dtype: int64

In [ ]:
data[[ 'Total Confirmed cases (Indian National)', 'Total Confirmed cases ( Foreign National )', 'Cured/Discharged/Migrated']]

,Total Confirmed cases (Indian National),Total Confirmed cases ( Foreign National ),Cured/Discharged/Migrated
0,1,0,0
1,1,0,0
2,2,0,0
3,3,0,0
4,3,0,0
...,...,...,...
914,0,0,43
915,0,0,0
916,0,0,46
917,0,0,5
918,0,0,29

slicing operator [] and dot operaror . used for indexing
it provides quick and easy access to pd data structures

In [ ]:
# To access a group of rows and columns by label(s)
# .loc[]
print("Label-based 'loc' method can be used for selecting row(s)")
print(data.iloc[3])

Label-based 'loc' method can be used for selecting row(s)
------------------------------------------------------------

Single row

Date                                          2020-02-02
Name of State / UT                                Kerala
Total Confirmed cases (Indian National)                3
Total Confirmed cases ( Foreign National )             0
Cured/Discharged/Migrated                              0
Latitude                                         10.8505
Longitude                                        76.2711
Death                                                  0
Total Confirmed cases                                  3
Name: 3, dtype: object

In [ ]:
print("Multiple rows")
print(data.iloc[[1,2]])

Multiple rows
         Date Name of State / UT  Total Confirmed cases (Indian National)  \
1  2020-01-31             Kerala                                        1
2  2020-02-01             Kerala                                        2

   Total Confirmed cases ( Foreign National )  Cured/Discharged/Migrated  \
1                                           0                          0
2                                           0                          0

   Latitude  Longitude Death  Total Confirmed cases
1   10.8505    76.2711     0                      1
2   10.8505    76.2711     0                      2

In [ ]:
## To access a group of rows and columns by label(s)
data.loc[:,'Total Confirmed cases']

0        1
1        1
2        2
3        3
4        3
      ...
914    504
915      2
916    483
917     35
918    152
Name: Total Confirmed cases, Length: 919, dtype: int64

In [ ]:
# To access a particular group of rows and columns by label(s)
data.loc[[1,2,4,6], ['Cured/Discharged/Migrated','Total Confirmed cases']]

   Cured/Discharged/Migrated  Total Confirmed cases
1                          0                      1
2                          0                      2
4                          0                      3
6                          0                      3

#**Sorting Data**

### **6 Q) Sort the entire data wrt Death cases in ascending order**

In [ ]:
#Sorting column and row names
data.sort_values(by='Death') #inplace=False by default
                                #works for strign as well (sort alphabetically)

,Date,Name of State / UT,Total Confirmed cases (Indian National),Total Confirmed cases ( Foreign National ),Cured/Discharged/Migrated,Latitude,Longitude,Death,Total Confirmed cases
0,2020-01-30,Kerala,1,0,0,10.8505,76.2711,0,1
463,2020-03-29,Mizoram,1,0,0,23.1645,92.9376,0,1
464,2020-03-29,Odisha,3,0,0,20.9517,85.0985,0,3
465,2020-03-29,Puducherry,1,0,0,11.9416,79.8083,0,1
467,2020-03-29,Rajasthan,52,2,3,27.0238,74.2179,0,54
...,...,...,...,...,...,...,...,...,...
782,2020-04-09,Maharashtra,0,0,117,19.7515,75.7139,72,1135
813,2020-04-10,Maharashtra,0,0,125,19.7515,75.7139,97,1364
844,2020-04-11,Maharashtra,0,0,188,19.7515,75.7139,110,1574
875,2020-04-12,Maharashtra,0,0,208,19.7515,75.7139,127,1761
906,2020-04-13,Maharashtra,0,0,217,19.7515,75.7139,149,1985

In [ ]:
data.sort_values(['Latitude',	'Longitude'], ascending=[1,0])

,Date,Name of State / UT,Total Confirmed cases (Indian National),Total Confirmed cases ( Foreign National ),Cured/Discharged/Migrated,Latitude,Longitude,Death,Total Confirmed cases
0,2020-01-30,Kerala,1,0,0,10.8505,76.2711,0,1
1,2020-01-31,Kerala,1,0,0,10.8505,76.2711,0,1
2,2020-02-01,Kerala,2,0,0,10.8505,76.2711,0,2
3,2020-02-02,Kerala,3,0,0,10.8505,76.2711,0,3
4,2020-02-03,Kerala,3,0,0,10.8505,76.2711,0,3
...,...,...,...,...,...,...,...,...,...
780,2020-04-09,Ladakh,0,0,10,34.2996,78.2932,0,14
811,2020-04-10,Ladakh,0,0,10,34.2996,78.2932,0,15
842,2020-04-11,Ladakh,0,0,10,34.2996,78.2932,0,15
873,2020-04-12,Ladakh,0,0,10,34.2996,78.2932,0,15
904,2020-04-13,Ladakh,0,0,10,34.2996,78.2932,0,15

#**Filtering**

### **7 Q) Remove all the records where number of Death are greater than 5 and Total Confirmed cases are greater than 100.**

In [ ]:
filter=(data['Death'] > 5) & (data['Total Confirmed cases']>100)    #to filter the records satisfying a particular condition
data.loc[filter].head()

,Date,Name of State / UT,Total Confirmed cases (Indian National),Total Confirmed cases ( Foreign National ),Cured/Discharged/Migrated,Latitude,Longitude,Death,Total Confirmed cases
461,2020-03-29,Maharashtra,183,3,25,19.7515,75.7139,6,186
488,2020-03-30,Maharashtra,0,0,25,19.7515,75.7139,8,193
515,2020-03-31,Maharashtra,0,0,39,19.7515,75.7139,9,216
544,2020-04-01,Maharashtra,0,0,39,19.7515,75.7139,9,302
572,2020-04-02,Maharashtra,0,0,42,19.7515,75.7139,13,335

#**Aggregate Statistics (Groupby function)**

### **8 Q) What is the maximum number of Total Confirmed cases in each state?**

In [ ]:
grp=data.groupby('Name of State / UT')
print(grp['Total Confirmed cases'].max())

Name of State / UT
Andaman and Nicobar Islands               11
Andhra Pradesh                           427
Arunachal Pradesh                          1
Assam                                     29
Bihar                                     64
Chandigarh                                21
Chhattisgarh                              31
Delhi                                   1154
Goa                                        7
Gujarat                                  516
Haryana                                  185
Himachal Pradesh                          32
Jammu and Kashmir                        245
Jharkhand                                 19
Karnataka                                232
Kerala                                   376
Ladakh                                    15
Madhya Pradesh                           564
Maharashtra                             1985
Manipur                                    2
Mizoram                                    1
Odisha                                    54
Puducherry                                 7
Punjab                                   151
Rajasthan                                804
Tamil Nadu                              1043
Telengana                                504
Tripura                                    2
Union Territory of Chandigarh              1
Union Territory of Jammu and Kashmir       4
Union Territory of Ladakh                 10
Uttar Pradesh                            483
Uttarakhand                               35
West Bengal                              152
Name: Total Confirmed cases, dtype: int64

### **9 Q) What is sum of total number of confirmed cases in each state?**

In [ ]:
grp=data.groupby('Name of State / UT')
print(grp['Total Confirmed cases'].agg(sum))

Name of State / UT
Andaman and Nicobar Islands               171
Andhra Pradesh                           3440
Arunachal Pradesh                          11
Assam                                     289
Bihar                                     560
Chandigarh                                311
Chhattisgarh                              207
Delhi                                    8023
Goa                                       107
Gujarat                                  3000
Haryana                                  1970
Himachal Pradesh                          226
Jammu and Kashmir                        1852
Jharkhand                                  86
Karnataka                                2742
Kerala                                   5945
Ladakh                                    327
Madhya Pradesh                           3265
Maharashtra                             13902
Manipur                                    31
Mizoram                                    20
Odisha                                    391
Puducherry                                 77
Punjab                                   1463
Rajasthan                                4990
Tamil Nadu                               8380
Telengana                                4638
Tripura                                     9
Union Territory of Chandigarh               2
Union Territory of Jammu and Kashmir       26
Union Territory of Ladakh                  58
Uttar Pradesh                            4431
Uttarakhand                               381
West Bengal                              1146
Name: Total Confirmed cases, dtype: int64

In [ ]:
data.groupby('Name of State / UT')['Total Confirmed cases'].sum()

Name of State / UT
Andaman and Nicobar Islands               171
Andhra Pradesh                           3440
Arunachal Pradesh                          11
Assam                                     289
Bihar                                     560
Chandigarh                                311
Chhattisgarh                              207
Delhi                                    8023
Goa                                       107
Gujarat                                  3000
Haryana                                  1970
Himachal Pradesh                          226
Jammu and Kashmir                        1852
Jharkhand                                  86
Karnataka                                2742
Kerala                                   5945
Ladakh                                    327
Madhya Pradesh                           3265
Maharashtra                             13902
Manipur                                    31
Mizoram                                    20
Odisha                                    391
Puducherry                                 77
Punjab                                   1463
Rajasthan                                4990
Tamil Nadu                               8380
Telengana                                4638
Tripura                                     9
Union Territory of Chandigarh               2
Union Territory of Jammu and Kashmir       26
Union Territory of Ladakh                  58
Uttar Pradesh                            4431
Uttarakhand                               381
West Bengal                              1146
Name: Total Confirmed cases, dtype: int64

### **10 Q) Sort the Total number of confirmed cases in each state/ UT in Descending order.**

### **11 Q) In which State or UT maximum number of confirmed cases were recorded?**

In [ ]:
data.groupby('Name of State / UT')['Total Confirmed cases'].sum().sort_values(ascending=False).head(10)

Name of State / UT
Maharashtra       13902
Tamil Nadu         8380
Delhi              8023
Kerala             5945
Rajasthan          4990
Telengana          4638
Uttar Pradesh      4431
Andhra Pradesh     3440
Madhya Pradesh     3265
Gujarat            3000
Name: Total Confirmed cases, dtype: int64

## **Grouping on Multiple Columns**

In [ ]:
data.groupby(['Date'])['Death','Total Confirmed cases','Cured/Discharged/Migrated','Name of State / UT'].max()          #groupby Date and have columns against that date, get the maximum cases on that date

/usr/local/lib/python3.6/dist-packages/ipykernel_launcher.py:1: FutureWarning: Indexing with multiple keys (implicitly converted to a tuple of keys) will be deprecated, use a list instead.
  """Entry point for launching an IPython kernel.

,Death,Total Confirmed cases,Cured/Discharged/Migrated,Name of State / UT
Date,,,,
2020-01-30,0,1,0,Kerala
2020-01-31,0,1,0,Kerala
2020-02-01,0,2,0,Kerala
2020-02-02,0,3,0,Kerala
2020-02-03,0,3,0,Kerala
...,...,...,...,...
2020-04-09,72,1135,117,West Bengal
2020-04-10,97,1364,125,West Bengal
2020-04-11,110,1574,188,West Bengal
2020-04-12,127,1761,208,West Bengal
2020-04-13,149,1985,217,West Bengal

### **12 Q) On which Date the maximum number Total Confirmed Cases were reported from Maharashtra?**

In [ ]:
#Lets Filter the data first 
new_data=data[data['Name of State / UT']=='Maharashtra']          #data['Name of State / UT']=='Maharashtra' will return bool values

In [ ]:
new_data.groupby('Total Confirmed cases')['Date'].max().sort_values(ascending=False).head(5)

Total Confirmed cases
1985    2020-04-13
1761    2020-04-12
1574    2020-04-11
1364    2020-04-10
1135    2020-04-09
Name: Date, dtype: object

#**Exploratory Data Analysis**

**Correlation**
Checking the relationship between Two Numerical Variables

In [ ]:
num_data = data.select_dtypes(exclude=[object])

In [ ]:
num_data.shape

(919, 6)

In [ ]:
corr_matrix=num_data.corr()
corr_matrix

,Total Confirmed cases (Indian National),Total Confirmed cases ( Foreign National ),Cured/Discharged/Migrated,Latitude,Longitude,Total Confirmed cases
Total Confirmed cases (Indian National),1.000000,0.286617,-0.034521,-0.108866,-0.185071,-0.037961
Total Confirmed cases ( Foreign National ),0.286617,1.000000,-0.050049,0.041526,-0.153329,-0.065913
Cured/Discharged/Migrated,-0.034521,-0.050049,1.000000,-0.114095,-0.162539,0.775171
Latitude,-0.108866,0.041526,-0.114095,1.000000,-0.031751,-0.104870
Longitude,-0.185071,-0.153329,-0.162539,-0.031751,1.000000,-0.174588
Total Confirmed cases,-0.037961,-0.065913,0.775171,-0.104870,-0.174588,1.000000

**Cross Tabulation**

Checking the relationship between two Categorical Variables

In [ ]:
data.dtypes

Date                                           object
Name of State / UT                             object
Total Confirmed cases (Indian National)         int64
Total Confirmed cases ( Foreign National )      int64
Cured/Discharged/Migrated                       int64
Latitude                                      float64
Longitude                                     float64
Death                                          object
Total Confirmed cases                           int64
dtype: object

In [ ]:
pd.crosstab(index = data['Date'], 
            columns=data['Name of State / UT'],
            margins=True,
            normalize=True,
            dropna=True)

Name of State / UT,Andaman and Nicobar Islands,Andhra Pradesh,Arunachal Pradesh,Assam,Bihar,Chandigarh,...,Union Territory of Jammu and Kashmir,Union Territory of Ladakh,Uttar Pradesh,Uttarakhand,West Bengal,All
Date,,,,,,,,,,,,,
2020-01-30,0.000000,0.000000,0.000000,0.000000,0.000000,0.000000,...,0.000000,0.000000,0.000000,0.000000,0.000000,0.001088
2020-01-31,0.000000,0.000000,0.000000,0.000000,0.000000,0.000000,...,0.000000,0.000000,0.000000,0.000000,0.000000,0.001088
2020-02-01,0.000000,0.000000,0.000000,0.000000,0.000000,0.000000,...,0.000000,0.000000,0.000000,0.000000,0.000000,0.001088
2020-02-02,0.000000,0.000000,0.000000,0.000000,0.000000,0.000000,...,0.000000,0.000000,0.000000,0.000000,0.000000,0.001088
2020-02-03,0.000000,0.000000,0.000000,0.000000,0.000000,0.000000,...,0.000000,0.000000,0.000000,0.000000,0.000000,0.001088
...,...,...,...,...,...,...,...,...,...,...,...,...,...
2020-04-10,0.001088,0.001088,0.001088,0.001088,0.001088,0.001088,...,0.000000,0.000000,0.001088,0.001088,0.001088,0.033732
2020-04-11,0.001088,0.001088,0.001088,0.001088,0.001088,0.001088,...,0.000000,0.000000,0.001088,0.001088,0.001088,0.033732
2020-04-12,0.001088,0.001088,0.001088,0.001088,0.001088,0.001088,...,0.000000,0.000000,0.001088,0.001088,0.001088,0.033732
2020-04-13,0.001088,0.001088,0.001088,0.001088,0.001088,0.001088,...,0.000000,0.000000,0.001088,0.001088,0.001088,0.033732
All,0.020675,0.035909,0.011970,0.014146,0.025027,0.026115,...,0.013058,0.015234,0.044614,0.032644,0.026115,1.000000

### **Handling Missing Values**

In [ ]:
##Drop nan/missing values

data.dropna(axis=0)

,Date,Name of State / UT,Total Confirmed cases (Indian National),Total Confirmed cases ( Foreign National ),Cured/Discharged/Migrated,Latitude,Longitude,Death,Total Confirmed cases
0,2020-01-30,Kerala,1,0,0,10.8505,76.2711,0,1
1,2020-01-31,Kerala,1,0,0,10.8505,76.2711,0,1
2,2020-02-01,Kerala,2,0,0,10.8505,76.2711,0,2
3,2020-02-02,Kerala,3,0,0,10.8505,76.2711,0,3
4,2020-02-03,Kerala,3,0,0,10.8505,76.2711,0,3
...,...,...,...,...,...,...,...,...,...
914,2020-04-13,Telengana,0,0,43,18.1124,79.0193,9,504
915,2020-04-13,Tripura,0,0,0,23.9408,91.9882,0,2
916,2020-04-13,Uttar Pradesh,0,0,46,26.8467,80.9462,5,483
917,2020-04-13,Uttarakhand,0,0,5,30.0668,79.0193,0,35
918,2020-04-13,West Bengal,0,0,29,22.9868,87.8550,7,152

In [ ]:
#Impute missing values
data.fillna('Missing')

,Date,Name of State / UT,Total Confirmed cases (Indian National),Total Confirmed cases ( Foreign National ),Cured/Discharged/Migrated,Latitude,Longitude,Death,Total Confirmed cases
0,2020-01-30,Kerala,1,0,0,10.8505,76.2711,0,1
1,2020-01-31,Kerala,1,0,0,10.8505,76.2711,0,1
2,2020-02-01,Kerala,2,0,0,10.8505,76.2711,0,2
3,2020-02-02,Kerala,3,0,0,10.8505,76.2711,0,3
4,2020-02-03,Kerala,3,0,0,10.8505,76.2711,0,3
...,...,...,...,...,...,...,...,...,...
914,2020-04-13,Telengana,0,0,43,18.1124,79.0193,9,504
915,2020-04-13,Tripura,0,0,0,23.9408,91.9882,0,2
916,2020-04-13,Uttar Pradesh,0,0,46,26.8467,80.9462,5,483
917,2020-04-13,Uttarakhand,0,0,5,30.0668,79.0193,0,35
918,2020-04-13,West Bengal,0,0,29,22.9868,87.8550,7,152

### **Dropping unwanted columns from the dataframe**

In [ ]:
data=data.drop(columns=['Latitude'])

In [ ]:
data

,Date,Name of State / UT,Total Confirmed cases (Indian National),Total Confirmed cases ( Foreign National ),Cured/Discharged/Migrated,Longitude,Death,Total Confirmed cases
0,2020-01-30,Kerala,1,0,0,76.2711,0,1
1,2020-01-31,Kerala,1,0,0,76.2711,0,1
2,2020-02-01,Kerala,2,0,0,76.2711,0,2
3,2020-02-02,Kerala,3,0,0,76.2711,0,3
4,2020-02-03,Kerala,3,0,0,76.2711,0,3
...,...,...,...,...,...,...,...,...
914,2020-04-13,Telengana,0,0,43,79.0193,9,504
915,2020-04-13,Tripura,0,0,0,91.9882,0,2
916,2020-04-13,Uttar Pradesh,0,0,46,80.9462,5,483
917,2020-04-13,Uttarakhand,0,0,5,79.0193,0,35
918,2020-04-13,West Bengal,0,0,29,87.8550,7,152

#**Reading and Writing Data to Different Sources**

In [ ]:
## URL to CSV
titanic = pd.read_csv("https://gist.githubusercontent.com/michhar/2dfd2de0d4f8727f873422c5d959fff5/raw/ff414a1bcfcba32481e4d4e8db578e55872a2ca1/titanic.csv",
                           sep='\t',index_col='Name')
titanic

,PassengerId,Survived,Pclass,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
Name,,,,,,,,,,,
"Braund, Mr. Owen Harris",1,0,3,male,22.0,1,0,A/5 21171,7.2500,NaN,S
"Cumings, Mrs. John Bradley (Florence Briggs Thayer)",2,1,1,female,38.0,1,0,PC 17599,71.2833,C85,C
"Heikkinen, Miss. Laina",3,1,3,female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
"Futrelle, Mrs. Jacques Heath (Lily May Peel)",4,1,1,female,35.0,1,0,113803,53.1000,C123,S
"Allen, Mr. William Henry",5,0,3,male,35.0,0,0,373450,8.0500,NaN,S
...,...,...,...,...,...,...,...,...,...,...,...
"Pears, Mrs. Thomas (Edith Wearne)",152,1,1,female,22.0,1,0,113776,66.6000,C2,S
"Meo, Mr. Alfonzo",153,0,3,male,55.5,0,0,A.5. 11206,8.0500,NaN,S
"van Billiard, Mr. Austin Blyler",154,0,3,male,40.5,0,2,A/5. 851,14.5000,NaN,S
"Olsen, Mr. Ole Martin",155,0,3,male,NaN,0,0,Fa 265302,7.3125,NaN,S
"Williams, Mr. Charles Duane",156,0,1,male,51.0,0,1,PC 17597,61.3792,NaN,C

In [ ]:
#importing txt file
df1 = pd.read_table('snacks.tsv')  # Read a tsv into a DataFrame with csv format using  sep='\t') 

df1.head()

,order_id,quantity,item_name,choice_description,item_price
0,1,1,Chips and Fresh Tomato Salsa,NaN,$2.39
1,1,1,Izze,[Clementine],$3.39
2,1,1,Nantucket Nectar,[Apple],$3.39
3,1,1,Chips and Tomatillo-Green Chili Salsa,NaN,$2.39
4,2,2,Chicken Bowl,"[Tomatillo-Red Chili Salsa (Hot), [Black Beans...",$16.98

In [ ]:
df2 = pd.read_csv('snacks.tsv', sep='\t',header=None)         #you can also include tabs ("\t") , commas and blanks
df2.head()

,0,1,2,3,4
0,order_id,quantity,item_name,choice_description,item_price
1,1,1,Chips and Fresh Tomato Salsa,NaN,$2.39
2,1,1,Izze,[Clementine],$3.39
3,1,1,Nantucket Nectar,[Apple],$3.39
4,1,1,Chips and Tomatillo-Green Chili Salsa,NaN,$2.39

In [ ]:
#importing excel files
df_xlsx=pd.read_excel('Employee_Salary.xlsx')        #Can also provide sheetname if you want to read particular sheet
df_xlsx.head()

,Id,EmployeeName,JobTitle,BasePay,OvertimePay,OtherPay,...,TotalPay,TotalPayBenefits,Year,Notes,Agency,Status
0,1,NATHANIEL FORD,GENERAL MANAGER-METROPOLITAN TRANSIT AUTHORITY,167411.18,0.00,400184.25,...,567595.43,567595.43,2011,NaN,San Francisco,NaN
1,2,GARY JIMENEZ,CAPTAIN III (POLICE DEPARTMENT),155966.02,245131.88,137811.38,...,538909.28,538909.28,2011,NaN,San Francisco,NaN
2,3,ALBERT PARDINI,CAPTAIN III (POLICE DEPARTMENT),212739.13,106088.18,16452.60,...,335279.91,335279.91,2011,NaN,San Francisco,NaN
3,4,CHRISTOPHER CHONG,WIRE ROPE CABLE MAINTENANCE MECHANIC,77916.00,56120.71,198306.90,...,332343.61,332343.61,2011,NaN,San Francisco,NaN
4,5,PATRICK GARDNER,"DEPUTY CHIEF OF DEPARTMENT,(FIRE DEPARTMENT)",134401.60,9737.00,182234.59,...,326373.19,326373.19,2011,NaN,San Francisco,NaN

In [ ]:
#To save in CSV fromat
titanic.to_csv('newtitanic.csv')

In [ ]:
#To save in excel fromat
df1.to_excel('new_snacks.xlsx')

In [ ]:
check = pd.read_excel('new_snacks.xlsx')
check.head()

,Unnamed: 0,order_id,quantity,item_name,choice_description,item_price
0,0,1,1,Chips and Fresh Tomato Salsa,NaN,$2.39
1,1,1,1,Izze,[Clementine],$3.39
2,2,1,1,Nantucket Nectar,[Apple],$3.39
3,3,1,1,Chips and Tomatillo-Green Chili Salsa,NaN,$2.39
4,4,2,2,Chicken Bowl,"[Tomatillo-Red Chili Salsa (Hot), [Black Beans...",$16.98

# **Demo Assignment for Pandas with Solutions**

In [ ]:
import numpy as np
import pandas as pd

In [ ]:
data = pd.read_csv('titanic.csv')
data.head()

   PassengerId  Survived  Pclass  ...     Fare Cabin  Embarked
0            1         0       3  ...   7.2500   NaN         S
1            2         1       1  ...  71.2833   C85         C
2            3         1       3  ...   7.9250   NaN         S
3            4         1       1  ...  53.1000  C123         S
4            5         0       3  ...   8.0500   NaN         S

[5 rows x 12 columns]

**1. How many men and women (sex feature) are represented in this dataset?**

In [ ]:
data['Sex'].value_counts()

male      577
female    314
Name: Sex, dtype: int64

**2. What is the average age (age feature) of women?**

In [ ]:
data.loc[data['Sex'] == 'female', 'Age'].mean()

27.915708812260537

**3. Select those passengers who embarked in Cherbourg (Embarked=C) and paid > 200 pounds for their ticker (fare > 200).**

In [ ]:
data[(data['Embarked'] == 'C') & (data.Fare > 200)].head()

     PassengerId  Survived  Pclass  ...      Fare            Cabin  Embarked
118          119         0       1  ...  247.5208          B58 B60         C
258          259         1       1  ...  512.3292              NaN         C
299          300         1       1  ...  247.5208          B58 B60         C
311          312         1       1  ...  262.3750  B57 B59 B63 B66         C
377          378         0       1  ...  211.5000              C82         C

[5 rows x 12 columns]

**4. Print the distribution of the Pclass feature. Then the same, but for men and women separately.**

**5. Display statistics of age for each Pclass and each gender. Use groupby() and describe(). Find the maximum age of men of Pclass=1**

In [ ]:
for (Pclass, Sex), sub_df in data.groupby(['Pclass', 'Sex']):
    print("Pclass: {0}, Sex: {1}".format(Pclass, Sex))
    print(sub_df['Age'].describe())

Pclass: 1, Sex: female
count    85.000000
mean     34.611765
std      13.612052
min       2.000000
25%      23.000000
50%      35.000000
75%      44.000000
max      63.000000
Name: Age, dtype: float64
Pclass: 1, Sex: male
count    101.000000
mean      41.281386
std       15.139570
min        0.920000
25%       30.000000
50%       40.000000
75%       51.000000
max       80.000000
Name: Age, dtype: float64
Pclass: 2, Sex: female
count    74.000000
mean     28.722973
std      12.872702
min       2.000000
25%      22.250000
50%      28.000000
75%      36.000000
max      57.000000
Name: Age, dtype: float64
Pclass: 2, Sex: male
count    99.000000
mean     30.740707
std      14.793894
min       0.670000
25%      23.000000
50%      30.000000
75%      36.750000
max      70.000000
Name: Age, dtype: float64
Pclass: 3, Sex: female
count    102.000000
mean      21.750000
std       12.729964
min        0.750000
25%       14.125000
50%       21.500000
75%       29.750000
max       63.000000
Name: Age, dtype: float64
Pclass: 3, Sex: male
count    253.000000
mean      26.507589
std       12.159514
min        0.420000
25%       20.000000
50%       25.000000
75%       33.000000
max       74.000000
Name: Age, dtype: float64

**6. What is the proportion of 'C' (Embarked feature)?**

In [ ]:
float((data['Embarked'] == 'C').sum()) / data.shape[0]

0.18855218855218855

**7. What are median and standard deviation of Fare?**

In [ ]:
print(data['Fare'].mean())
print(data['Fare'].std())

32.2042079685746
49.693428597180905

**8. How is average age for men/women dependent on Pclass? **

In [ ]:
for (Pclass, Sex), sub_df in data.groupby(['Pclass', 'Sex']):
    print("Pclass: {0}, Sex: {1}".format(Pclass, Sex))
    print(sub_df['Age'].mean())

Pclass: 1, Sex: female
34.61176470588235
Pclass: 1, Sex: male
41.28138613861386
Pclass: 2, Sex: female
28.722972972972972
Pclass: 2, Sex: male
30.74070707070707
Pclass: 3, Sex: female
21.75
Pclass: 3, Sex: male
26.507588932806325